{
      "experiences": [
            {
                  "id": 1,
                  "company": "BSM Labs",
                  "position": "Flutter Developer",
                  "location": "Hanoi, Vietnam",
                  "period": "03/2024 - present",
                  "description": "Develop and maintain mobile applications in the healthcare and augmented reality (AR) domains using Flutter.",
                  "achievements": [
                        "Built, released, and maintained 4 production Flutter applications published on stores, across Healthcare, Social, AR, and AI-assisted diagnosis domains.",
                        "Built cross-platform mobile applications (Android, IOS) using Flutter & Dart, covering the full development lifecycle: feature development, bug fixing, performance optimization, and store release.",
                        "Implemented UI/UX components based on Figma designs, including custom widgets, animations, navigation flows, and responsive layouts",
                        "Improved application performance and stability by optimizing widget rebuilds, fixing memory & performance issues, and resolving production crashes",
                        "Integrated REST APIs and third-party SDKs, collaborating closely with backend and design teams",
                        "Implemented real-time features using Socket.IO for real-time data synchronization and messaging.",
                        "Integrated AR features by embedding Unity modules into Flutter applications, handling Flutter–Unity communication and platform-specific builds."
                  ],
                  "technologies": [
                        "Flutter",
                        "Bloc",
                        "GetX",
                        "Firebase",
                        "REST API",
                        "Third-party SDKs",
                        "Git"
                  ]
            },
            {
                  "id": 2,
                  "company": "Newwave Solutions",
                  "position": "Flutter Developer",
                  "location": "Hanoi, Vietnam",
                  "period": "08/2023 - 03/2024",
                  "description": "Developed Flutter applications for multiple client projects based on Figma designs.",
                  "achievements": [
                        "Built Flutter UI screens and reusable components from Figma designs.",
                        "Worked with REST APIs and basic state management using Provider and Riverpod.",
                        "Adhered to clean code principles and team Git workflows."
                  ],
                  "technologies": [
                        "Flutter",
                        "Provider",
                        "Riverpod",
                        "REST API",
                        "Git"
                  ]
            }
      ]
}